Autodesk.Revit.DB.PointCloudColorMode
Color mode of a point cloud or part of a point cloud
Since:
2014

Autodesk.Revit.DB.PointCloudColorMode.Normals
Color by normal vectors

Autodesk.Revit.DB.PointCloudColorMode.Intensity
Color by intensity (reflectivity)

Autodesk.Revit.DB.PointCloudColorMode.Elevation
Color by elevation

Autodesk.Revit.DB.PointCloudColorMode.FixedColor
Show a single color

Autodesk.Revit.DB.PointCloudColorMode.NoOverride
Show the actual colors